---
kind: property
id: P:Autodesk.Revit.DB.DividedSurface.HostReference
source: html/c90a0505-ae70-eac4-94a4-d72289a90e62.htm
---
# Autodesk.Revit.DB.DividedSurface.HostReference Property

A reference to the divided face on the host.

## Syntax (C#)
```csharp
public Reference HostReference { get; }
```

## Remarks
This is the same as the hostReference argument
to the NewDividedSurface method of FamilyItemFactory .